{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model", "config": {"name": "model", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 256, 256, 3]}, "inbound_nodes": []}, {"name": "conv2d", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 16, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "leaky_re_lu", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu", "trainable": true}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"name": "average_pooling2d", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_1", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 16, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_1", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_2", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_3", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_3", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_4", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_4", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_5", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_5", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_6", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_6", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_7", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_7", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_8", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_8", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_4", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_9", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_9", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_10", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_10", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"dtype": "float32", "name": "average_pooling2d_5", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_11", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_11", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_12", "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"seed": null, "dtype": "float32", "name": "dropout", "noise_shape": null, "trainable": true, "rate": 0.01}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 1, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}}