{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["dense_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 16, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "leaky_re_lu", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]], "name": "average_pooling2d", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_1", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 16, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_2", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_3", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_4", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_5", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_6", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_7", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_8", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_9", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_9", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_10", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_10", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_5", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_11", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_11", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "flatten", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "dtype": "float32", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense", "class_name": "Dense", "config": {"trainable": true, "name": "dense", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_12", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout", "seed": null, "rate": 0.01, "dtype": "float32", "noise_shape": null}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}]}}