{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0], ["input_10", 0, 0]], "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_9", "batch_input_shape": [null, 256, 256, 1]}, "inbound_nodes": []}, {"name": "activation", "class_name": "Activation", "config": {"dtype": "float32", "name": "activation", "trainable": false, "activation": "linear"}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "cropping2d", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d", "cropping": [[64, 64], [64, 64]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "cropping2d_1", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d_1", "cropping": [[32, 32], [32, 32]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["cropping2d", 0, 0, {}]]]}, {"name": "cropping2d_2", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d_2", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "input_10", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_10", "batch_input_shape": [null, 1]}, "inbound_nodes": []}, {"name": "cropping2d_3", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d_3", "cropping": [[8, 8], [8, 8]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["cropping2d_2", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 4096, "trainable": false, "kernel_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "activity_regularizer": null}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "cropping2d_4", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d_4", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["cropping2d_3", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape", "trainable": false, "target_shape": [4, 4, 256]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "cropping2d_5", "class_name": "Cropping2D", "config": {"dtype": "float32", "name": "cropping2d_5", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last", "trainable": false}, "inbound_nodes": [[["cropping2d_4", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_13", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_12", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_5", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"dtype": "float32", "name": "add", "trainable": false}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_12", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_1", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_2", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "ada_instance_normalization", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add", 0, 0, {}], ["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_13", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_15", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_14", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_5", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"dtype": "float32", "name": "add_1", "trainable": false}, "inbound_nodes": [[["conv2d_15", 0, 0, {}], ["conv2d_14", 0, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_3", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "reshape_4", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_4", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "ada_instance_normalization_1", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_1", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_1", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_14", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_14", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_1", 0, 0, {}]]]}, {"name": "up_sampling2d", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_3", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_17", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["up_sampling2d", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_16", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_4", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"dtype": "float32", "name": "add_2", "trainable": false}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["conv2d_16", 0, 0, {}]]]}, {"name": "reshape_5", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_5", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_6", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"name": "ada_instance_normalization_2", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_2", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_2", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_15", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_15", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_19", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_18", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 256, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_4", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 256, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"dtype": "float32", "name": "add_3", "trainable": false}, "inbound_nodes": [[["conv2d_19", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_7", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "reshape_8", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_8", "trainable": false, "target_shape": [1, 1, 256]}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"name": "ada_instance_normalization_3", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_3", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_3", 0, 0, {}], ["reshape_7", 0, 0, {}], ["reshape_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_16", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_16", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_3", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d_1", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"name": "input_4", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_4", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_21", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_20", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_3", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 192, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 192, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"dtype": "float32", "name": "add_4", "trainable": false}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_20", 0, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_9", "trainable": false, "target_shape": [1, 1, 192]}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"name": "reshape_10", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_10", "trainable": false, "target_shape": [1, 1, 192]}, "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"name": "ada_instance_normalization_4", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_4", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_4", 0, 0, {}], ["reshape_9", 0, 0, {}], ["reshape_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_17", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_17", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_23", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_22", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 192, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_3", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 192, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 192, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"dtype": "float32", "name": "add_5", "trainable": false}, "inbound_nodes": [[["conv2d_23", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"name": "reshape_11", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_11", "trainable": false, "target_shape": [1, 1, 192]}, "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"name": "reshape_12", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_12", "trainable": false, "target_shape": [1, 1, 192]}, "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"name": "ada_instance_normalization_5", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_5", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_5", 0, 0, {}], ["reshape_11", 0, 0, {}], ["reshape_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_18", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_5", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d_2", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"name": "input_5", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_5", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_25", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_24", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_2", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"dtype": "float32", "name": "add_6", "trainable": false}, "inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_24", 0, 0, {}]]]}, {"name": "reshape_13", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_13", "trainable": false, "target_shape": [1, 1, 128]}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"name": "reshape_14", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_14", "trainable": false, "target_shape": [1, 1, 128]}, "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"name": "ada_instance_normalization_6", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_6", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_6", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}]]]}, {"name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_19", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_27", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_26", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 128, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_2", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"dtype": "float32", "name": "add_7", "trainable": false}, "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}, {"name": "reshape_15", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_15", "trainable": false, "target_shape": [1, 1, 128]}, "inbound_nodes": [[["dense_17", 0, 0, {}]]]}, {"name": "reshape_16", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_16", "trainable": false, "target_shape": [1, 1, 128]}, "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"name": "ada_instance_normalization_7", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_7", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_7", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_16", 0, 0, {}]]]}, {"name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_20", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d_3", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"name": "input_6", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_6", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_29", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_28", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"dtype": "float32", "name": "add_8", "trainable": false}, "inbound_nodes": [[["conv2d_29", 0, 0, {}], ["conv2d_28", 0, 0, {}]]]}, {"name": "reshape_17", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_17", "trainable": false, "target_shape": [1, 1, 64]}, "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"name": "reshape_18", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_18", "trainable": false, "target_shape": [1, 1, 64]}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "ada_instance_normalization_8", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_8", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_8", 0, 0, {}], ["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_21", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_31", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_30", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 64, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "dense_21", "class_name": "Dense", "config": {"name": "dense_21", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_22", "class_name": "Dense", "config": {"name": "dense_22", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"dtype": "float32", "name": "add_9", "trainable": false}, "inbound_nodes": [[["conv2d_31", 0, 0, {}], ["conv2d_30", 0, 0, {}]]]}, {"name": "reshape_19", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_19", "trainable": false, "target_shape": [1, 1, 64]}, "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"name": "reshape_20", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_20", "trainable": false, "target_shape": [1, 1, 64]}, "inbound_nodes": [[["dense_22", 0, 0, {}]]]}, {"name": "ada_instance_normalization_9", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_9", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_9", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}]]]}, {"name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_22", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d_4", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]]}, {"name": "input_7", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_7", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_33", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_32", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 32, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 32, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"dtype": "float32", "name": "add_10", "trainable": false}, "inbound_nodes": [[["conv2d_33", 0, 0, {}], ["conv2d_32", 0, 0, {}]]]}, {"name": "reshape_21", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_21", "trainable": false, "target_shape": [1, 1, 32]}, "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"name": "reshape_22", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_22", "trainable": false, "target_shape": [1, 1, 32]}, "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"name": "ada_instance_normalization_10", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_10", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_10", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_22", 0, 0, {}]]]}, {"name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_23", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_35", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"name": "conv2d_34", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_34", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "trainable": false, "padding": "same", "kernel_size": [1, 1], "dtype": "float32", "kernel_constraint": null, "filters": 32, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["cropping2d", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 32, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "dense_26", "class_name": "Dense", "config": {"name": "dense_26", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 32, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"dtype": "float32", "name": "add_11", "trainable": false}, "inbound_nodes": [[["conv2d_35", 0, 0, {}], ["conv2d_34", 0, 0, {}]]]}, {"name": "reshape_23", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_23", "trainable": false, "target_shape": [1, 1, 32]}, "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"name": "reshape_24", "class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_24", "trainable": false, "target_shape": [1, 1, 32]}, "inbound_nodes": [[["dense_26", 0, 0, {}]]]}, {"name": "ada_instance_normalization_11", "class_name": "AdaInstanceNormalization", "config": {"momentum": 0.99, "dtype": "float32", "name": "ada_instance_normalization_11", "scale": true, "center": true, "axis": -1, "epsilon": 0.001, "trainable": false}, "inbound_nodes": [[["add_11", 0, 0, {}], ["reshape_23", 0, 0, {}], ["reshape_24", 0, 0, {}]]]}, {"name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_24", "trainable": false}, "inbound_nodes": [[["ada_instance_normalization_11", 0, 0, {}]]]}, {"name": "up_sampling2d_5", "class_name": "UpSampling2D", "config": {"dtype": "float32", "name": "up_sampling2d_5", "size": [2, 2], "trainable": false, "data_format": "channels_last"}, "inbound_nodes": 