{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0], ["input_10", 0, 0]], "name": "model_1", "output_layers": [["conv2d_40", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "name": "input_9", "sparse": false}}, {"inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "activation", "class_name": "Activation", "config": {"trainable": false, "name": "activation", "dtype": "float32", "activation": "linear"}}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "name": "cropping2d", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d", "dtype": "float32", "cropping": [[64, 64], [64, 64]]}}, {"inbound_nodes": [[["cropping2d", 0, 0, {}]]], "name": "cropping2d_1", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d_1", "dtype": "float32", "cropping": [[32, 32], [32, 32]]}}, {"inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "cropping2d_2", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d_2", "dtype": "float32", "cropping": [[16, 16], [16, 16]]}}, {"inbound_nodes": [], "name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_10", "sparse": false}}, {"inbound_nodes": [[["cropping2d_2", 0, 0, {}]]], "name": "cropping2d_3", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d_3", "dtype": "float32", "cropping": [[8, 8], [8, 8]]}}, {"inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"trainable": false, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "bias_regularizer": null, "units": 4096, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_3", 0, 0, {}]]], "name": "cropping2d_4", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d_4", "dtype": "float32", "cropping": [[4, 4], [4, 4]]}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "reshape", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape", "dtype": "float32", "target_shape": [4, 4, 256]}}, {"inbound_nodes": [[["cropping2d_4", 0, 0, {}]]], "name": "cropping2d_5", "class_name": "Cropping2D", "config": {"data_format": "channels_last", "trainable": false, "name": "cropping2d_5", "dtype": "float32", "cropping": [[2, 2], [2, 2]]}}, {"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_13", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_5", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_12", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"trainable": false, "name": "dense_3", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"trainable": false, "name": "dense_4", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "name": "add", "class_name": "Add", "config": {"trainable": false, "name": "add", "dtype": "float32"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_1", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "reshape_2", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_2", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["add", 0, 0, {}], ["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "name": "ada_instance_normalization", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization", 0, 0, {}]]], "name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_13", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_15", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_5", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_14", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"trainable": false, "name": "dense_5", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_6", "class_name": "Dense", "config": {"trainable": false, "name": "dense_6", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": false, "name": "add_1", "dtype": "float32"}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "reshape_3", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_3", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["dense_6", 0, 0, {}]]], "name": "reshape_4", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_4", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["add_1", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}]]], "name": "ada_instance_normalization_1", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_1", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_14", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_14", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "up_sampling2d", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d", "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [], "name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_3", "sparse": false}}, {"inbound_nodes": [[["up_sampling2d", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_17", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_4", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_16", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "dense_7", "class_name": "Dense", "config": {"trainable": false, "name": "dense_7", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "dense_8", "class_name": "Dense", "config": {"trainable": false, "name": "dense_8", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}], ["conv2d_16", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": false, "name": "add_2", "dtype": "float32"}}, {"inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "reshape_5", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_5", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["dense_8", 0, 0, {}]]], "name": "reshape_6", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_6", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["add_2", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}]]], "name": "ada_instance_normalization_2", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_2", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_15", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_15", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_19", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_4", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_18", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "dense_9", "class_name": "Dense", "config": {"trainable": false, "name": "dense_9", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "dense_10", "class_name": "Dense", "config": {"trainable": false, "name": "dense_10", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": false, "name": "add_3", "dtype": "float32"}}, {"inbound_nodes": [[["dense_9", 0, 0, {}]]], "name": "reshape_7", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_7", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["dense_10", 0, 0, {}]]], "name": "reshape_8", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_8", "dtype": "float32", "target_shape": [1, 1, 256]}}, {"inbound_nodes": [[["add_3", 0, 0, {}], ["reshape_7", 0, 0, {}], ["reshape_8", 0, 0, {}]]], "name": "ada_instance_normalization_3", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_3", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_3", 0, 0, {}]]], "name": "leaky_re_lu_16", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_16", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d_1", "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [], "name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_4", "sparse": false}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_21", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_3", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_20", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "dense_11", "class_name": "Dense", "config": {"trainable": false, "name": "dense_11", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 192, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "dense_12", "class_name": "Dense", "config": {"trainable": false, "name": "dense_12", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 192, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_20", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": false, "name": "add_4", "dtype": "float32"}}, {"inbound_nodes": [[["dense_11", 0, 0, {}]]], "name": "reshape_9", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_9", "dtype": "float32", "target_shape": [1, 1, 192]}}, {"inbound_nodes": [[["dense_12", 0, 0, {}]]], "name": "reshape_10", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_10", "dtype": "float32", "target_shape": [1, 1, 192]}}, {"inbound_nodes": [[["add_4", 0, 0, {}], ["reshape_9", 0, 0, {}], ["reshape_10", 0, 0, {}]]], "name": "ada_instance_normalization_4", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_4", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_4", 0, 0, {}]]], "name": "leaky_re_lu_17", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_17", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_23", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_3", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_22", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 192, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "dense_13", "class_name": "Dense", "config": {"trainable": false, "name": "dense_13", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 192, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "dense_14", "class_name": "Dense", "config": {"trainable": false, "name": "dense_14", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 192, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}], ["conv2d_22", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"trainable": false, "name": "add_5", "dtype": "float32"}}, {"inbound_nodes": [[["dense_13", 0, 0, {}]]], "name": "reshape_11", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_11", "dtype": "float32", "target_shape": [1, 1, 192]}}, {"inbound_nodes": [[["dense_14", 0, 0, {}]]], "name": "reshape_12", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_12", "dtype": "float32", "target_shape": [1, 1, 192]}}, {"inbound_nodes": [[["add_5", 0, 0, {}], ["reshape_11", 0, 0, {}], ["reshape_12", 0, 0, {}]]], "name": "ada_instance_normalization_5", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_5", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_5", 0, 0, {}]]], "name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_18", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d_2", "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [], "name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_5", "sparse": false}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_25", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_2", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_24", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "dense_15", "class_name": "Dense", "config": {"trainable": false, "name": "dense_15", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "dense_16", "class_name": "Dense", "config": {"trainable": false, "name": "dense_16", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}], ["conv2d_24", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"trainable": false, "name": "add_6", "dtype": "float32"}}, {"inbound_nodes": [[["dense_15", 0, 0, {}]]], "name": "reshape_13", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_13", "dtype": "float32", "target_shape": [1, 1, 128]}}, {"inbound_nodes": [[["dense_16", 0, 0, {}]]], "name": "reshape_14", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_14", "dtype": "float32", "target_shape": [1, 1, 128]}}, {"inbound_nodes": [[["add_6", 0, 0, {}], ["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}]]], "name": "ada_instance_normalization_6", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_6", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_6", 0, 0, {}]]], "name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_19", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_27", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_2", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_26", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "dense_17", "class_name": "Dense", "config": {"trainable": false, "name": "dense_17", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "dense_18", "class_name": "Dense", "config": {"trainable": false, "name": "dense_18", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_26", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"trainable": false, "name": "add_7", "dtype": "float32"}}, {"inbound_nodes": [[["dense_17", 0, 0, {}]]], "name": "reshape_15", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_15", "dtype": "float32", "target_shape": [1, 1, 128]}}, {"inbound_nodes": [[["dense_18", 0, 0, {}]]], "name": "reshape_16", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_16", "dtype": "float32", "target_shape": [1, 1, 128]}}, {"inbound_nodes": [[["add_7", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_16", 0, 0, {}]]], "name": "ada_instance_normalization_7", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_7", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_7", 0, 0, {}]]], "name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_20", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]], "name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d_3", "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [], "name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_6", "sparse": false}}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_29", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_29", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_28", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "dense_19", "class_name": "Dense", "config": {"trainable": false, "name": "dense_19", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "dense_20", "class_name": "Dense", "config": {"trainable": false, "name": "dense_20", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}], ["conv2d_28", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"trainable": false, "name": "add_8", "dtype": "float32"}}, {"inbound_nodes": [[["dense_19", 0, 0, {}]]], "name": "reshape_17", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_17", "dtype": "float32", "target_shape": [1, 1, 64]}}, {"inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "reshape_18", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_18", "dtype": "float32", "target_shape": [1, 1, 64]}}, {"inbound_nodes": [[["add_8", 0, 0, {}], ["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}]]], "name": "ada_instance_normalization_8", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_8", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_21", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "name": "conv2d_31", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_31", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "conv2d_30", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_30", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "dense_21", "class_name": "Dense", "config": {"trainable": false, "name": "dense_21", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "dense_22", "class_name": "Dense", "config": {"trainable": false, "name": "dense_22", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_31", 0, 0, {}], ["conv2d_30", 0, 0, {}]]], "name": "add_9", "class_name": "Add", "config": {"trainable": false, "name": "add_9", "dtype": "float32"}}, {"inbound_nodes": [[["dense_21", 0, 0, {}]]], "name": "reshape_19", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_19", "dtype": "float32", "target_shape": [1, 1, 64]}}, {"inbound_nodes": [[["dense_22", 0, 0, {}]]], "name": "reshape_20", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_20", "dtype": "float32", "target_shape": [1, 1, 64]}}, {"inbound_nodes": [[["add_9", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}]]], "name": "ada_instance_normalization_9", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_9", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_9", 0, 0, {}]]], "name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_22", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]], "name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d_4", "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [], "name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_7", "sparse": false}}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_33", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_33", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d", 0, 0, {}]]], "name": "conv2d_32", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_32", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "dense_23", "class_name": "Dense", "config": {"trainable": false, "name": "dense_23", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 32, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "dense_24", "class_name": "Dense", "config": {"trainable": false, "name": "dense_24", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}], ["conv2d_32", 0, 0, {}]]], "name": "add_10", "class_name": "Add", "config": {"trainable": false, "name": "add_10", "dtype": "float32"}}, {"inbound_nodes": [[["dense_23", 0, 0, {}]]], "name": "reshape_21", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_21", "dtype": "float32", "target_shape": [1, 1, 32]}}, {"inbound_nodes": [[["dense_24", 0, 0, {}]]], "name": "reshape_22", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_22", "dtype": "float32", "target_shape": [1, 1, 32]}}, {"inbound_nodes": [[["add_10", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_22", 0, 0, {}]]], "name": "ada_instance_normalization_10", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_10", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_23", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]], "name": "conv2d_35", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_35", "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["cropping2d", 0, 0, {}]]], "name": "conv2d_34", "class_name": "Conv2D", "config": {"trainable": false, "name": "conv2d_34", "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "dense_25", "class_name": "Dense", "config": {"trainable": false, "name": "dense_25", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 32, "bias_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "dense_26", "class_name": "Dense", "config": {"trainable": false, "name": "dense_26", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}], ["conv2d_34", 0, 0, {}]]], "name": "add_11", "class_name": "Add", "config": {"trainable": false, "name": "add_11", "dtype": "float32"}}, {"inbound_nodes": [[["dense_25", 0, 0, {}]]], "name": "reshape_23", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_23", "dtype": "float32", "target_shape": [1, 1, 32]}}, {"inbound_nodes": [[["dense_26", 0, 0, {}]]], "name": "reshape_24", "class_name": "Reshape", "config": {"trainable": false, "name": "reshape_24", "dtype": "float32", "target_shape": [1, 1, 32]}}, {"inbound_nodes": [[["add_11", 0, 0, {}], ["reshape_23", 0, 0, {}], ["reshape_24", 0, 0, {}]]], "name": "ada_instance_normalization_11", "class_name": "AdaInstanceNormalization", "config": {"trainable": false, "name": "ada_instance_normalization_11", "scale": true, "axis": -1, "momentum": 0.99, "dtype": "float32", "center": true, "epsilon": 0.001}}, {"inbound_nodes": [[["ada_instance_normalization_11", 0, 0, {}]]], "name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_24", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]], "name": "up_sampling2d_5", "class_name": "UpSampling2D", "config": {"trainable": false, "name": "up_sampling2d_5", 