{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_11", 0, 0]], "name": "model_2", "output_layers": [["dense_34", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "name": "input_11", "sparse": false}}, {"inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "dense_31", "class_name": "Dense", "config": {"trainable": false, "name": "dense_31", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense_31", 0, 0, {}]]], "name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_27", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]], "name": "dense_32", "class_name": "Dense", "config": {"trainable": false, "name": "dense_32", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense_32", 0, 0, {}]]], "name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_28", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]], "name": "dense_33", "class_name": "Dense", "config": {"trainable": false, "name": "dense_33", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense_33", 0, 0, {}]]], "name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"trainable": false, "name": "leaky_re_lu_29", "dtype": "float32", "alpha": 0.009999999776482582}}, {"inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]], "name": "dense_34", "class_name": "Dense", "config": {"trainable": false, "name": "dense_34", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null}}]}}