{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model", "config": {"name": "model_2", "input_layers": [["input_11", 0, 0]], "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_11", "batch_input_shape": [null, 512]}, "inbound_nodes": []}, {"name": "dense_31", "class_name": "Dense", "config": {"name": "dense_31", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 512, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_27", "trainable": false}, "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"name": "dense_32", "class_name": "Dense", "config": {"name": "dense_32", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 512, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_28", "trainable": false}, "inbound_nodes": [[["dense_32", 0, 0, {}]]]}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 512, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"alpha": 0.009999999776482582, "dtype": "float32", "name": "leaky_re_lu_29", "trainable": false}, "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 512, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}], "output_layers": [["dense_34", 0, 0]]}}